In [1]:
from platform import python_version

print(python_version())

3.7.9

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

import pandas as pd

import gc

In [3]:
import gc #garbage collector
from playsound import playsound
#!pip install playsound

import time

start_time = time.time()

In [4]:
from surprise import Dataset
from surprise import Reader
from surprise.model_selection import train_test_split

In [5]:
path_data = "..\\data\\"
figures = "..\\figures\\"
netflix = "..\\data\\netflix-prize-data\\"

In [6]:
df1 = pd.read_csv(netflix + 'combined_data_1_with_movie_id.csv', dtype={'Rating': np.int8, 'movie_id': np.int16})
print(df1.shape)
df1.head()

(24053764, 3)

      User  Rating  Movie_id
0  1488844       3         1
1   822109       5         1
2   885013       4         1
3    30878       4         1
4   823519       3         1

In [7]:
df_title = pd.read_csv(netflix +'movie_titles.csv', encoding = "ISO-8859-1",index_col = 0, header = None, usecols = [0,2], names = ['Movie_Id', 'Name'])
df_title.head()

                                  Name
Movie_Id
1                      Dinosaur Planet
2           Isle of Man TT 2004 Review
3                            Character
4         Paula Abdul's Get Up & Dance
5             The Rise and Fall of ECW

In [8]:
reader = Reader()

In [9]:
print(reader)

<surprise.reader.Reader object at 0x000001155A269548>

In [10]:
N_filas = 100000

In [11]:
data = Dataset.load_from_df(df1[['User', 'Movie_id', 'Rating']][:N_filas], reader)

In [12]:
trainset, testset = train_test_split(data, test_size=.25)

In [15]:
from surprise import SVD
algo = SVD()

In [16]:
algo.fit(trainset)

In [17]:
prediction = algo.test(testset)

In [19]:
algo.predict(1328945,28)

Prediction(uid=1328945, iid=28, r_ui=None, est=3.844560595788657, details={'was_impossible': False})

In [20]:
df1.head()

      User  Rating  Movie_id
0  1488844       3         1
1   822109       5         1
2   885013       4         1
3    30878       4         1
4   823519       3         1

In [34]:
messi = 1539350
rating = 5

In [28]:
df_title

                                                       Name
Movie_Id
1                                           Dinosaur Planet
2                                Isle of Man TT 2004 Review
3                                                 Character
4                              Paula Abdul's Get Up & Dance
5                                  The Rise and Fall of ECW
...                                                     ...
17766     Where the Wild Things Are and Other Maurice Se...
17767                     Fidel Castro: American Experience
17768                                                 Epoch
17769                                           The Company
17770                                          Alien Hunter

[17770 rows x 1 columns]

In [35]:
df_user = df1[(df1["User"] == messi) & (df1["Rating"]>= rating)]
df_user.reset_index(drop=True)
df_user["Name"] = df_title["Name"].loc[df_user.Movie_id].values

C:\ProgramData\Anaconda3\envs\acamica\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [36]:
df_user

             User  Rating  Movie_id                                   Name
1183325   1539350       5       269                             Parenthood
1219057   1539350       5       270             Sex and the City: Season 4
2170404   1539350       5       406                                Hostage
6183892   1539350       5      1202            National Lampoon's Vacation
14863884  1539350       5      2862               The Silence of the Lambs
16327782  1539350       5      3151                      Napoleon Dynamite
18779767  1539350       5      3605  The Wizard of Oz: Collector's Edition
20899561  1539350       5      3928                     Nip/Tuck: Season 2
22114087  1539350       5      4159                             Barbershop

In [37]:
recomendaciones_usuario = df_title.iloc[:4499].copy()
print(recomendaciones_usuario.shape)
recomendaciones_usuario.head()

(4499, 1)

                                  Name
Movie_Id
1                      Dinosaur Planet
2           Isle of Man TT 2004 Review
3                            Character
4         Paula Abdul's Get Up & Dance
5             The Rise and Fall of ECW

In [39]:
usuario_vistas = df1[df1["User"] == messi]
usuario_vistas

             User  Rating  Movie_id
219870    1539350       3        33
409717    1539350       4       111
445206    1539350       3       127
664099    1539350       4       175
894718    1539350       4       197
...           ...     ...       ...
23362600  1539350       4      4369
23422750  1539350       4      4384
23532453  1539350       3      4393
23795128  1539350       3      4432
23837575  1539350       4      4465

[97 rows x 3 columns]

In [41]:
recomendaciones_usuario.drop(usuario_vistas.Movie_id,inplace = True)

recomendaciones_usuario

                                                    Name
Movie_Id
1                                        Dinosaur Planet
2                             Isle of Man TT 2004 Review
3                                              Character
4                           Paula Abdul's Get Up & Dance
5                               The Rise and Fall of ECW
...                                                  ...
4495      Clifford: Happy Birthday Clifford / Puppy Love
4496                               Farewell My Concubine
4497                                          Texasville
4498                                               Gonin
4499                                          In My Skin

[4402 rows x 1 columns]

In [42]:

recomendaciones_usuario  = recomendaciones_usuario.reset_index()
recomendaciones_usuario

      Movie_Id                                            Name
0            1                                 Dinosaur Planet
1            2                      Isle of Man TT 2004 Review
2            3                                       Character
3            4                    Paula Abdul's Get Up & Dance
4            5                        The Rise and Fall of ECW
...        ...                                             ...
4397      4495  Clifford: Happy Birthday Clifford / Puppy Love
4398      4496                           Farewell My Concubine
4399      4497                                      Texasville
4400      4498                                           Gonin
4401      4499                                      In My Skin

[4402 rows x 2 columns]

In [44]:
recomendaciones_usuario["Estimatate_Score"] = recomendaciones_usuario["Movie_Id"].apply(lambda x: algo.predict(messi, x).est)

In [45]:
recomendaciones_usuario = recomendaciones_usuario.sort_values("Estimatate_Score", ascending=False)

In [46]:
print(recomendaciones_usuario.head(10))

    Movie_Id                                               Name  \
12        13  Lord of the Rings: The Return of the King: Ext...
24        25      Inspector Morse 31: Death Is Now My Neighbour
4          5                           The Rise and Fall of ECW
27        28                                    Lilo and Stitch
17        18                                   Immortal Beloved
0          1                                    Dinosaur Planet
29        30                             Something's Gotta Give
2          3                                          Character
1          2                         Isle of Man TT 2004 Review
22        23  Clifford: Clifford Saves the Day! / Clifford's...

    Estimatate_Score
12          4.474994
24          4.060394
4           3.932115
27          3.844561
17          3.801724
0           3.786529
29          3.772626
2           3.730242
1           3.714839
22          3.629656